import "./App.scss";
import Chat from "./components/Chat/Chat";
import Guess from "./components/Guess/Guess";
function App() {
  return (
    <div className="main-container">
      <div className="task-wrapper">
        <h3>Task 1</h3>
        <p>
          Приклад. Створити імітатор мессенджера. Є можлиість
          додавати/відображати повідомлення і ставити лайки (додайте стилі на
          свій розсуд).
        </p>
        <Chat />
      </div>
      <div className="task-wrapper">
        <h3>Task 2</h3>
        <p>
          Задача. Гра “Вгадай число”. Правила гри: 1) комп”ютер генерує
          трицифрове число; 2) кожен гравець по черзі задає цифру, якої ще не
          було (відсліковуємо, щоб цифри не повторювалися гравцями — не
          дозволяємо повторно ввести (блокуємо кнопку “Зробити хід”)). 3) якщо
          цифру вгадано, вона відображаться у полі гри “Число”; 4) програє той,
          хто вгадав останню цифру.
        </p>
        <Guess />
      </div>
    </div>
  );
}

export default App;
